akk = []

print "Привет,желаешь сыграть в крестики-нолики? (Y/N).."
x = gets.strip.capitalize

	if x == "Y"
		puts "*********************"
		puts "Отлично!!!(Enter..)"
		gets
		puts "*********************"	  
	else
		puts "**************"
	    puts "Ну и ладно!!!"
	    puts "**************"
	    exit
	   end 

#===========================================================================================
       print "Ник 1-го игрока: "
       name1 = gets.strip.capitalize
       
        print "Ник 2-го игрока: "
       name2 = gets.strip.capitalize

       if name1 == "" && name2 == ""
       		puts "ВВЕДИТЕ НИК!!"
       
       		print "Ник 1-го игрока: "
       		name1 = gets.strip.capitalize
       

      		print "Ник 2-го игрока: "
       		name2 = gets.strip.capitalize
   end


#===========================================================================================
   puts "Привет, #{name1} и #{name2}! (Enter).."
   gets

     puts "Сейчас определим кто играет _X_, а кто _0_ ? (Enter).."
     gets
      
       akk << name1
       akk << name2
       k = rand(0..1)
         
	if k == 0
			puts "_X_ играет #{name1}, _0_ играет #{name2}"
			puts "Enter.."
			gets
	elsif k == 1
			puts "_X_ играет #{name2}, _0_ играет #{name1}"
			puts "Enter.."
			gets
	end				
         
      		

#========================================================================================
     puts "
                      
                          |           | 
                          |           |
                          |           |
                          |           |
               ----------------------------------
                          |           |
                          |           | 
                          |           |
                          |           |
               ----------------------------------
                          |           | 
                          |           |
                          |           |
                          |           |
"
     


